# Join Statements

## Introduction

In this lab, you'll practice your knowledge on Join statements.

## Objectives

You will be able to:
- Write queries that make use of various types of Joins
- Join tables using foreign keys

## CRM Schema

In almost all cases, rather then just working with a single table we will typically need data from multiple tables. 
Doing this requires the use of **joins ** using shared columns from the two tables. 

In this lab, we'll use the same Customer Relationship Management (CRM) database we used in our lecture before!
<img src='Database-Schema.png' width=550>

## Connecting to the Database
Import the necessary packages and connect to the database **data.sqlite**.

In [2]:
#Your code here
import sqlite3
import pandas as pd
conn = sqlite3.connect('data.sqlite', detect_types=sqlite3.PARSE_COLNAMES)
cur=conn.cursor()

## Display the names of all the employees in Boston.

In [3]:
#Your code here
cur.execute('''SELECT lastName, firstName 
                FROM employees 
                JOIN offices  
                USING(officeCode) 
                WHERE city = 'Boston';
                 ''')
df = pd.DataFrame(cur.fetchall())
#df.columns = [cur.description[0][0], cur.description[1][0]]
df.columns = [i[0] for i in cur.description]
df.head()

    lastName firstName
0   Firrelli     Julie
1  Patterson     Steve

## Do any offices have no employees?

In [4]:
#Your code here
cur.execute('''SELECT officeCode , city ,employeeNumber 
            FROM offices 
            LEFT JOIN employees e USING(officeCode)
            WHERE employeeNumber IS NULL;''')
df = pd.DataFrame(cur.fetchall())
df.head()
#There are no offices that have no employees

Empty DataFrame
Columns: []
Index: []

## Write 3 Questions of your own and answer them

In [5]:
# Answers will vary
#Who are the top 3 customers with the highest total payments?
cur.execute('''SELECT customername, sum(amount) 
                FROM customers
                JOIN payments USING(customerNumber)
                GROUP BY customername 
                ORDER BY 2 desc LIMIT 3;''')
df = pd.DataFrame(cur.fetchall())
df.columns = [i[0] for i in cur.description]
df.head()

                   customerName  sum(amount)
0        Euro+ Shopping Channel    715738.98
1  Mini Gifts Distributors Ltd.    584188.24
2    Australian Collectors, Co.    180585.07

In [6]:
# Your code here
#What are the top 5 products ordered?
cur.execute('''SELECT  productName, SUM(quantityOrdered) as TotalQty
                FROM orderdetails 
                JOIN products p USING(productCode)
                Group BY productName
                ORDER BY 2 DESC LIMIT 5; ''')
df = pd.DataFrame(cur.fetchall())
df.columns = [i[0] for i in cur.description]
df.head()

                               productName  TotalQty
0              1992 Ferrari 360 Spider red      1808
1                     1937 Lincoln Berline      1111
2                American Airlines: MD-11S      1085
3  1941 Chevrolet Special Deluxe Cabriolet      1076
4             1930 Buick Marquette Phaeton      1074

In [9]:
# Your code here
#Who is the top productVendor with the most number of products ordered?
cur.execute('''SELECT  productVendor, SUM(quantityOrdered) as TotalQty
                FROM orderdetails 
                JOIN products p USING(productCode)
                JOIN productLines l USING(productLine)
                Group BY productVendor
                ORDER by 2 DESC LIMIT 1; ''')
df = pd.DataFrame(cur.fetchall())
df.head()

                         0     1
0  Classic Metal Creations  9678

In [8]:
# Your code here
#What product has the highest MSRP?
cur.execute('''SELECT productName, Max(MSRP) 
                FROM products; ''')
df = pd.DataFrame(cur.fetchall())
df.columns = [i[0] for i in cur.description]
df.head()

        productName Max(MSRP)
0  1997 BMW F650 ST     99.89

## Level Up: Display the names of each product each employee has sold.

In [12]:
# Your code here
cur.execute('''SELECT DISTINCT firstName,lastName, productname
                FROM employees e 
                JOIN customers c on c.salesRepEmployeeNumber = e.employeeNumber
                JOIN orders o USING(customerNumber)
                JOIN orderdetails d USING(orderNumber)
                JOIN products p USING(productCode)
                ORDER BY 1,3;''')
df = pd.DataFrame(cur.fetchall())
df.columns = [i[0] for i in cur.description]
df.head()

  firstName lastName                          productName
0      Andy   Fixter  18th Century Vintage Horse Carriage
1      Andy   Fixter               1900s Vintage Bi-Plane
2      Andy   Fixter              1900s Vintage Tri-Plane
3      Andy   Fixter                   1911 Ford Town Car
4      Andy   Fixter          1913 Ford Model T Speedster

## Level Up: Display the Number of Products each Employee Has sold

In [13]:
#Your code here
cur.execute('''SELECT  firstName,lastName, SUM(quantityOrdered)
                FROM employees e 
                JOIN customers c on c.salesRepEmployeeNumber = e.employeeNumber
                JOIN orders o USING(customerNumber)
                JOIN orderdetails d USING(orderNumber)
                JOIN products p USING(productCode)
                GROUP BY employeeNumber
                ORDER BY 3 DESC;''')
df = pd.DataFrame(cur.fetchall())
df.columns = [i[0] for i in cur.description]
df.head()

  firstName   lastName  SUM(quantityOrdered)
0    Gerard  Hernandez                 14231
1    Leslie   Jennings                 11854
2    Pamela   Castillo                  9290
3     Larry       Bott                  8205
4     Barry      Jones                  7486

## Summary

Congrats! You now know how to use Join statements, along with leveraging your foreign keys knowledge!